In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df_input = pd.read_csv(r"heights.csv")
df_input.head()

    name  height
0  mohan     1.2
1  maria     4.6
2  sakib     4.9
3    tao     5.1
4  virat     5.2

In [5]:
q1 , q3 = df_input['height'].quantile([0.25, 0.75])
print("Q1:", q1)
print("Q3:", q3)
iqr = q3 - q1
print("IQR:", iqr)

Q1: 5.3500000000000005
Q3: 6.275
IQR: 0.9249999999999998

In [8]:
lower_limit = q1 - 1.5 * iqr
upper_limit = q3 + 1.5 * iqr
print("Lower Limit:", lower_limit)
print("Upper Limit:", upper_limit)

Lower Limit: 3.962500000000001
Upper Limit: 7.6625

In [10]:
df_outliers = df_input.loc[(df_input['height'] < lower_limit) | (df_input['height'] > upper_limit)]
df_outliers

     name  height
0   mohan     1.2
19    Liu    40.2